baseCase/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-5 -5 0)
    (15 -5 0)
    (15 5 0)
    (-5 5 0)
    (-5 -5 0.1)
    (15 -5 0.1)
    (15 5 0.1)
    (-5 5 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 3 7 4));
    }

    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }

    top
    {
        type symmetryPlane;
        faces ((3 2 6 7));
    }

    bottom
    {
        type symmetryPlane;
        faces ((0 1 5 4));
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
