baseCase/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    cylinder.stl
    {
        type triSurfaceMesh;
        name cylinder;
    }
}

castellatedMeshControls
{
    maxLocalCells       1000000;
    maxGlobalCells      5000000;
    minRefinementCells  10;
    nCellsBetweenLevels 4;
    features
    (
    );
    refinementSurfaces
    {
        cylinder
        {
            level (2 2);
            patchInfo
            {
                type wall;
            }
        }
    }
    refinementRegions
    {
    }
    resolveFeatureAngle 30;
    locationInMesh (2 2 0.05);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance    2.0;
    nSolveIter   30;
    nRelaxIter   5;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
    }

    expansionRatio         1.0;
    finalLayerThickness    0.3;
    minThickness           0.1;
    nGrow                  0;
    featureAngle           60;
    nRelaxIter             3;
    nSmoothSurfaceNormals  1;
    nSmoothNormals         1;
    nSmoothThickness       10;
    maxFaceThicknessRatio  0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle     90;
    nBufferCellsNoExtrude  0;
    nLayerIter             50;
}

meshQualityControls
{
    #include "meshQualityDict"
}

writeFlags
(
    scalarLevels
);

mergeTolerance 1e-6;
