baseCase/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxNonOrtho          65;
maxBoundarySkewness  20;
maxInternalSkewness  4;
maxConcave           80;
minVol               1e-13;
minTetQuality        1e-15;
minArea              -1;
minTwist             0.02;
minDeterminant       0.001;
minFaceWeight        0.05;
minVolRatio          0.01;
minTriangleTwist     -1;
minFlatness          0.5;
minCellVolume        1e-13;
minCellDeterminant   0.001;

nSmoothScale    4;
errorReduction  0.75;

relaxed
{
    maxNonOrtho 75;
}

// ************************************************************************* //
